# IDropHandler Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IDropHandler Members
IDropHandler Interface Methods See Also
---
The IDropHandler type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Execute | Implement this method to handle the drop event for your data. |

# See Also
IDropHandler Interface
Autodesk.Revit.UI Namespace